gratinDeTopinambour/Moisture-sensor/Program/STM32U073CB/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdint.h>
#include <stdbool.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Probe_Capa_Pin GPIO_PIN_12
#define Probe_Capa_GPIO_Port GPIOB
#define Sampling_Capa_Pin GPIO_PIN_13
#define Sampling_Capa_GPIO_Port GPIOB
#define RED_LED_Pin GPIO_PIN_3
#define RED_LED_GPIO_Port GPIOB
#define CAL_SW_Pin GPIO_PIN_4
#define CAL_SW_GPIO_Port GPIOB
#define CAL_SW_EXTI_IRQn EXTI4_15_IRQn
#define MES_SW_Pin GPIO_PIN_5
#define MES_SW_GPIO_Port GPIOB
#define MES_SW_EXTI_IRQn EXTI4_15_IRQn

/* USER CODE BEGIN Private defines */

typedef enum
{
	START,
	CALIBRATION,
	MEASUREMENT,
	BLINK_LED,
	SLEEP_MODE
}State;

typedef struct
{
	volatile bool need_calibration;
	volatile bool need_measurement;
	volatile bool low_humidity;
}Flag;

extern Flag system_flag;

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
